notes/5--Types.org
#+Title: Types
#+Subtitle: Principles of Programming Languages
#+Author: Mark Armstrong
#+Date: Fall 2020
#+Description: Introduction to types
#+Options: toc:nil

* HTML settings                                 :noexport:

** Reveal settings

#+Reveal_root: ./reveal.js
#+Reveal_init_options: width:1600, height:900, controlsLayout:'edges',
#+Reveal_init_options: margin: 0.1, minScale:0.125, maxScale:5,
#+Reveal_init_options: mouseWheel: true
#+Reveal_extra_css: local.css

# #+HTML: <script src="https://cdnjs.cloudflare.com/ajax/libs/headjs/0.96/head.min.js"></script>

* LaTeX settings                                :noexport:

#+LaTeX_header: \usepackage{amsthm}
#+LaTeX_header: \theoremstyle{definition}
#+LaTeX_header: \newtheorem{definition}{Definition}[section]

#+LaTeX_header: \usepackage{unicode-math}
#+LaTeX_header: \usepackage{unicode}

* Preamble

** Notable references

- Robert W. Sebesta, “Concepts of Programming Languages” (10th edition)
  - Chapter 6, Data Types

- Benjamin Pierce,
  “[[https://ebookcentral.proquest.com/lib/mcmu/detail.action?docID=3338823][Types and Programming Languages]]”
  - Chapter 11, Simple Extensions
    - Unit, Tuples, Sums, Variants, Lists.
  - Chapter 13, References
    - Reference types.
  - Chapter 20, Recursive types

** TODO Table of contents

# The table of contents are added using org-reveal-manual-toc,
# and so must be updated upon changes or added last.
# Note that hidden headings are included, and so must be deleted!

#+HTML: <font size="-1">
#+begin_scriptsize
  - [[Preamble][Preamble]]
#+end_scriptsize
#+HTML: </font>

* Introduction

This section introduces the concepts of /types/,
a particularly useful language safety feature.

Common simple types and methods of building new types are discussed,
as well as some more advanced topics.

The discussion in this section is fairly “encyclopedic”;
the next section on the typed λ-calculus give some insight about
how some of these types can be incorporated into a programming system.

* Properties of type systems

In the previous notes, we have discussed
- polymorphism and
- static/dynamic typing
which are two important properties of a type system.

Here we discuss some other commonly discussed properties,
before discussing in the following sections
what is arguably the most important property:
what types a language might have.

** “Strong” and “weak” typing

These are comparative terms.
- We'll consider them a subjective criteria.

“Strongly typed”
- Languages are frequently called strongly typed.
  - But less frequently do they state what they mean by that.
  - The term is used inconsistently.
    - “C is a strongly typed, weakly checked language”
      – Dennis Ritchie, creator of C

“Weakly typed” simply means not strongly typed.

*** So what does “strongly typed” mean?

We will take it to mean “type clashes are restricted”.
- A /type clash/ being an instance where one type is expected
  but a different, incompatible type is provided.
  - Such as added a string to an integer.
- That definition does not make a good objective property.
  - What does restricted mean?
    - Is it a warning or an error?
    - Does type casting violate this?
  - What qualifies as a type clash?
    - Is implicit type casting allowed?

*** Exercise: Examples of implicit type casting

What are the results of these two Javascript output statements?
#+begin_src js :results output
console.log(1 + 2 + "3")
console.log("1" + 2 + 3)
#+end_src

#+RESULTS:
: 33
: 123

How about the following C++ code?
(This is arguably not quite an example of implicit type casting.)
#+begin_src C++
#include<iostream>

int main() {
  std::cout << ("Hello" + 1);
}
#+end_src

#+RESULTS:
: ello

** Explicit and implicit typing

Languages may require annotations on variables and functions
(/explicit typing/) or allow them to be omitted (/implicit typing/).
- Implicit typing does not weaken the typing system in any way!
  - A very common misconception.
- In general, type inference is an undecidable problem
  (its not guaranteed that the compiler/interpreter can
  determine the type).
  - Most languages have relatively simple type systems,
    and this is not a problem.
  - We will likely later study the /Hindley-Milner/ type system
    for the λ-calculus, which is used for many
    functional languages and supports parametric polymorphism.
    
*** Implicit typing by name

Some languages make type annotations a part of the name,
or annotate names with sigils to indicate type details.
- In older versions of Fortran, names beginning with
  ~i~, ~j~ or ~k~ were for integer variables,
  and all variables were of floating point.
- In Perl, names beginning with the sigil
  - ~$~ have scalar type,
  - ~@~ have array type,
  - ~%~ have hash type, and
  - ~&~ have subroutine type.

* Atomic types

** Preamble                                    :ignore:

We begin our discussion of what types languages have
with what are usually the “simplest” types: /atomic/ types.
- Atomic in the sense that they cannot be broken down any further.
- Sometimes called /primitive/ or /basic/.

** Ubiquitous basic types
  
Most languages have at least these atomic types.
- *Integers*; ~int~
  - Including possibly signed, unsigned, short, and/or long variants.
- *Floating point* numbers
  - Including possibly single precision and double precision variants.
- *Characters*
  - Sometimes an alternate name for the byte type (8-bit integers).
- *Booleans*
  - Which, of course, can be stored in a bit,
    but will usually be stored in at least a word (4 bits)
    or perhaps even a byte (8 bits)
    for convenience of memory access.
  
