notes/5--Types.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Types</title>
<meta name="author" content="(Mark Armstrong)"/>
<meta name="description" content="Introduction to types"/>
<link rel="stylesheet" href="./reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/dist/theme/black.css" id="theme"/>

<link rel="stylesheet" href="local.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h2 class="title">Types</h2>
   <h3>Principles of Programming Languages</h3>
   <h4>Mark Armstrong</h4>
   <h5>Fall 2020</h5>
</section>

<section>
<section id="slide-orgf8897d5">
<h2 id="orgf8897d5"><span class="section-number-2">1</span> Preamble</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-org6a28605">
<h3 id="org6a28605"><span class="section-number-3">1.1</span> Notable references</h3>
<ul>
<li>Robert W. Sebesta, “Concepts of Programming Languages” (10th edition)
<ul>
<li>Chapter 6, Data Types</li>

</ul></li>

<li>Benjamin Pierce,
“<a href="https://ebookcentral.proquest.com/lib/mcmu/detail.action?docID=3338823">Types and Programming Languages</a>”
<ul>
<li>Chapter 11, Simple Extensions
<ul>
<li>Unit, Tuples, Sums, Variants, Lists.</li>

</ul></li>
<li>Chapter 13, References
<ul>
<li>Reference types.</li>

</ul></li>
<li>Chapter 20, Recursive types</li>

</ul></li>

</ul>

</section>
<section id="slide-org488e009">
<h3 id="org488e009"><span class="section-number-3">1.2</span> <span class="todo TODO">TODO</span> Table of contents</h3>
<font size="-1">
<div class="scriptsize" id="org81fafc6">
<ul>
<li><a href="#/slide-orgf8897d5">Preamble</a></li>

</ul>

</div>
</font>

</section>
</section>
<section>
<section id="slide-org8ff89db">
<h2 id="org8ff89db"><span class="section-number-2">2</span> Introduction</h2>
<p>
This section introduces the concepts of <i>types</i>,
a particularly useful language safety feature.
</p>

<p>
Common simple types and methods of building new types are discussed,
as well as some more advanced topics.
</p>

<p>
The discussion in this section is fairly “encyclopedic”;
the next section on the typed λ-calculus give some insight about
how some of these types can be incorporated into a programming system.
</p>

</section>
</section>
<section>
<section id="slide-org3771049">
<h2 id="org3771049"><span class="section-number-2">3</span> Properties of type systems</h2>
<p>
In the previous notes, we have discussed
</p>
<ul>
<li>polymorphism and</li>
<li>static/dynamic typing</li>

</ul>
<p>
which are two important properties of a type system.
</p>

<p>
Here we discuss some other commonly discussed properties,
before discussing in the following sections
what is arguably the most important property:
what types a language might have.
</p>

</section>
<section id="slide-orgeed8063">
<h3 id="orgeed8063"><span class="section-number-3">3.1</span> “Strong” and “weak” typing</h3>
<p>
These are comparative terms.
</p>
<ul>
<li>We'll consider them a subjective criteria.</li>

</ul>

<p>
“Strongly typed”
</p>
<ul>
<li>Languages are frequently called strongly typed.
<ul>
<li>But less frequently do they state what they mean by that.</li>
<li>The term is used inconsistently.
<ul>
<li>“C is a strongly typed, weakly checked language”
– Dennis Ritchie, creator of C</li>

</ul></li>

</ul></li>

</ul>

<p>
“Weakly typed” simply means not strongly typed.
</p>

</section>
<section id="slide-org8cd6567">
<h4 id="org8cd6567"><span class="section-number-4">3.1.1</span> So what does “strongly typed” mean?</h4>
<p>
We will take it to mean “type clashes are restricted”.
</p>
<ul>
<li>A <i>type clash</i> being an instance where one type is expected
but a different, incompatible type is provided.
<ul>
<li>Such as added a string to an integer.</li>

</ul></li>
<li>That definition does not make a good objective property.
<ul>
<li>What does restricted mean?
<ul>
<li>Is it a warning or an error?</li>
<li>Does type casting violate this?</li>

</ul></li>
<li>What qualifies as a type clash?
<ul>
<li>Is implicit type casting allowed?</li>

</ul></li>

</ul></li>

</ul>

</section>
<section id="slide-org414827d">
<h4 id="org414827d"><span class="section-number-4">3.1.2</span> Exercise: Examples of implicit type casting</h4>
<p>
What are the results of these two Javascript output statements?
</p>
<div class="org-src-container">

<pre  class="src src-js"><code trim>console.log<span style="color: #00cd68;">(</span>1 + 2 + <span style="color: #79a8ff;">"3"</span><span style="color: #00cd68;">)</span>
console.log<span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"1"</span> + 2 + 3<span style="color: #00cd68;">)</span>
</code></pre>
</div>

<p>
How about the following C++ code?
(This is arguably not quite an example of implicit type casting.)
</p>
<div class="org-src-container">

<pre  class="src src-C++"><code trim><span style="color: #ff9977;">#include</span><span style="color: #00cd68;">&lt;</span><span style="color: #79a8ff;">iostream</span><span style="color: #00cd68;">&gt;</span>

<span style="color: #f78fe7;">int</span> <span style="color: #feacd0;">main</span><span style="color: #00cd68;">()</span> <span style="color: #00cd68;">{</span>
  <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #b6a0ff;">(</span><span style="color: #79a8ff;">"Hello"</span> + 1<span style="color: #b6a0ff;">)</span>;
<span style="color: #00cd68;">}</span>
</code></pre>
</div>

</section>
<section id="slide-org37b3994">
<h3 id="org37b3994"><span class="section-number-3">3.2</span> Explicit and implicit typing</h3>
<p>
Languages may require annotations on variables and functions
(<i>explicit typing</i>) or allow them to be omitted (<i>implicit typing</i>).
</p>
<ul>
<li>Implicit typing does not weaken the typing system in any way!
<ul>
<li>A very common misconception.</li>

</ul></li>
<li>In general, type inference is an undecidable problem
(its not guaranteed that the compiler/interpreter can
determine the type).
<ul>
<li>Most languages have relatively simple type systems,
and this is not a problem.</li>
<li>We will likely later study the <i>Hindley-Milner</i> type system
for the λ-calculus, which is used for many
functional languages and supports parametric polymorphism.</li>

</ul></li>

</ul>

</section>
<section id="slide-orgd8804b2">
<h4 id="orgd8804b2"><span class="section-number-4">3.2.1</span> Implicit typing by name</h4>
<p>
Some languages make type annotations a part of the name,
or annotate names with sigils to indicate type details.
</p>
<ul>
<li>In older versions of Fortran, names beginning with
<code>i</code>, <code>j</code> or <code>k</code> were for integer variables,
and all variables were of floating point.</li>
<li>In Perl, names beginning with the sigil
<ul>
<li><code>$</code> have scalar type,</li>
<li><code>@</code> have array type,</li>
<li><code>%</code> have hash type, and</li>
<li><code>&amp;</code> have subroutine type.</li>

</ul></li>

</ul>

</section>
</section>
<section>
<section id="slide-org1da9390">
<h2 id="org1da9390"><span class="section-number-2">4</span> Atomic types</h2>
<p>
We begin our discussion of what types languages have
with what are usually the “simplest” types: <i>atomic</i> types.
</p>
<ul>
<li>Atomic in the sense that they cannot be broken down any further.</li>
<li>Sometimes called <i>primitive</i> or <i>basic</i>.</li>

</ul>

</section>
<section id="slide-orgf0ad614">
<h3 id="orgf0ad614"><span class="section-number-3">4.1</span> Ubiquitous basic types</h3>
<p>
Most languages have at least these atomic types.
</p>
<ul>
<li><b>Integers</b>; <code>int</code>
<ul>
<li>Including possibly signed, unsigned, short, and/or long variants.</li>

</ul></li>
<li><b>Floating point</b> numbers
<ul>
<li>Including possibly single precision and double precision variants.</li>

</ul></li>
<li><b>Characters</b>
<ul>
<li>Sometimes an alternate name for the byte type (8-bit integers).</li>

</ul></li>
<li><b>Booleans</b>
<ul>
<li>Which, of course, can be stored in a bit,
but will usually be stored in at least a word (4 bits)
or perhaps even a byte (8 bits)
for convenience of memory access.</li>

</ul></li>

</ul>

</section>
