notes/5--Types.org
** Singleton and empty types

- *Unit* (the /singleton/ type)
  - Sometimes called ~void~, ~nil~-type, ~null~-type or ~none~-type.
    - In C-like languages, you cannot store something of type ~void~.
      - But this value still implicitely exists;
        a function of type ~void~ can certainly
        return, implying it returns something of type ~void~.
    - Commonly represented as the type of 0-ary tuples,
      whose only element is ~()~.
- *Empty*
  - Unlike a singleton type, which has a single value
    (called ~nil~, ~null~ or ~none~), there is
    (or should be) *nothing* in the empty type.
    - This might be violated by using error values.
    - For instance, in Haskell, the term referred to as ~bottom~ or ⊥
      —which refers to any computation which never completes—
       is a member of all types, even the empty type.
  - No function with return type ~Empty~ should
    ever be able return.

*** Singleton and empty types in Haskell

#+begin_src haskell :results output
data Unit = Unit -- This type Unit has a single constructor, also called Unit.
data Empty -- Empty has no constructors.

-- Previous versions of Haskell required a workaround to write Empty,
-- as a constructor list was mandatory;
-- this alternate definition has a constructor also called EmptyAlt,
-- but using this constructor requires an argument of type EmptyAlt
-- to already exist, so should never actually be usable.
data EmptyAlt = EmptyAlt EmptyAlt


-- The bottom can be defined by unending recursion.
bottom = bottom
  
x = Unit

-- We can cheat and get Empty/EmptyAlt "values" by using bottom.
y = bottom :: Empty
z = bottom :: EmptyAlt

-- Check the types of these values
:t x   -- reports x :: Unit
:t y   -- reports y :: Empty
:t z   -- reports z :: EmptyAlt
#+end_src
@@html:Use the scroll bar to see the full example.@@

** Implementation of atomic types

When we discussed the pure untyped λ-calculus,
we discussed the process of /encoding/ the integers and booleans
as functions, since they were not included in the language.
- We also mentioned that we can add constants for them
  to the language, forming an /unpure/ untyped λ-calculus.

This raises a question we can ask about
“practical” programming languages as well;
- are the “atomic” (“primitive”, “basic”) types /truly/ atomic
  (primitive, basic), or are they represented
  using one of the language's abstractions?
- We have discussed the fact that in Scala and Ruby, which we call
  “purely object-oriented”, even these atomic types are classes!
  - Whereas in Java and C++, they are not;
    there, they are “primitives” which exist
    outside the object-oriented abstraction.

** Atom or symbol types

Many languages include a type of /atoms/ or /symbols/,
which are essentially interned strings.
- Strings which are immutable,
  and of which there is only one copy in memory.

Specifically, decendents of Lisp and Prolog tend to have a symbol type.

For instance, in Ruby:
#+begin_src ruby :results output
# A symbol in Ruby begins with a :
x = :hello

# We can intern strings using an intern method
y = "hello".intern

# The equal? method checks if two values are the same object.
# These all evaluate to true, since there's only one copy of the symbol hello.
puts x.equal?(y)
puts :hello.equal?(x)
puts y.equal?(:hello)

# But this to false, because these are two copies of the same string!
puts "hello".equal?("hello")
#+end_src

#+RESULTS:
: true
: true
: true
: false
  
** Ordinal types

Many languages include a means of defining other /finite/ types.
Instances include
- enumeration types (~enum~'s) and
- subset/subrange types.

For instance, Pascal supports both enumerations
and subranges.
(This example based on one from the [[https://wiki.freepascal.org/Data_type][Free Pascal and Lazarus Wiki]].)
#+begin_src pascal
type
  // An enumeration type; unless specified,
  // the first element is implicitely assigned the ordinal value 0,
  // the second ordinal value 1, etc.
  DaysOfWeek = (Sunday, Monday, Tuesday, Wednesday,
                Thursday, Friday, Saturday);

  // A subrange type.
  // In this case, DaysOfWorkWeek contains the ordinals 1,2,3,4 and 5.
  DaysOfWorkWeek = Monday..Friday;
#+end_src

** Less common numeric types

- *Complex* numbers
  - Especially for scientific computation.
- *Decimal* (representation of) numbers
  - Especially for business (monetary) applications.
  - There are decimal numbers that cannot be properly represented
    using binary (e.g. ~0.3 = 0.010011~, repeating)
  - Not included in all languages because
    they cannot be efficiently represented.
    - For instance, to store a decimal digit directly
      (without conversion to binary) takes at least 4 bits.
    - There are 10 possibilities, too many for 3 bits (which can
      only have 8 different states.)
    - But 4 bits could represent 16 states (6 more than needed.)
    - For memory access reasons, some such implementations
      even use 8 bits (one byte) per decimal digit.

