notes/5--Types.html
<section id="slide-orgeebc312">
<h3 id="orgeebc312"><span class="section-number-3">4.2</span> Singleton and empty types</h3>
<ul>
<li><b>Unit</b> (the <i>singleton</i> type)
<ul>
<li>Sometimes called <code>void</code>, <code>nil</code>-type, <code>null</code>-type or <code>none</code>-type.
<ul>
<li>In C-like languages, you cannot store something of type <code>void</code>.
<ul>
<li>But this value still implicitely exists;
a function of type <code>void</code> can certainly
return, implying it returns something of type <code>void</code>.</li>

</ul></li>
<li>Commonly represented as the type of 0-ary tuples,
whose only element is <code>()</code>.</li>

</ul></li>

</ul></li>
<li><b>Empty</b>
<ul>
<li>Unlike a singleton type, which has a single value
(called <code>nil</code>, <code>null</code> or <code>none</code>), there is
(or should be) <b>nothing</b> in the empty type.
<ul>
<li>This might be violated by using error values.</li>
<li>For instance, in Haskell, the term referred to as <code>bottom</code> or ⊥
—which refers to any computation which never completes—
 is a member of all types, even the empty type.</li>

</ul></li>
<li>No function with return type <code>Empty</code> should
ever be able return.</li>

</ul></li>

</ul>

</section>
<section id="slide-org1ed4bcf">
<h4 id="org1ed4bcf"><span class="section-number-4">4.2.1</span> Singleton and empty types in Haskell</h4>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b6a0ff;">data</span> <span style="color: #f78fe7;">Unit</span> <span style="color: #00d3d0;">=</span> <span style="color: #f78fe7;">Unit</span> <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">This type Unit has a single constructor, also called Unit.</span>
<span style="color: #b6a0ff;">data</span> <span style="color: #f78fe7;">Empty</span> <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">Empty has no constructors.</span>

<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">Previous versions of Haskell required a workaround to write Empty,</span>
<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">as a constructor list was mandatory;</span>
<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">this alternate definition has a constructor also called EmptyAlt,</span>
<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">but using this constructor requires an argument of type EmptyAlt</span>
<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">to already exist, so should never actually be usable.</span>
<span style="color: #b6a0ff;">data</span> <span style="color: #f78fe7;">EmptyAlt</span> <span style="color: #00d3d0;">=</span> <span style="color: #f78fe7;">EmptyAlt</span> <span style="color: #f78fe7;">EmptyAlt</span>


<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">The bottom can be defined by unending recursion.</span>
<span style="color: #feacd0;">bottom</span> <span style="color: #00d3d0;">=</span> bottom
  
<span style="color: #feacd0;">x</span> <span style="color: #00d3d0;">=</span> <span style="color: #f78fe7;">Unit</span>

<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">We can cheat and get Empty/EmptyAlt "values" by using bottom.</span>
<span style="color: #feacd0;">y</span> <span style="color: #00d3d0;">=</span> bottom <span style="color: #00d3d0;">::</span> <span style="color: #f78fe7;">Empty</span>
<span style="color: #feacd0;">z</span> <span style="color: #00d3d0;">=</span> bottom <span style="color: #00d3d0;">::</span> <span style="color: #f78fe7;">EmptyAlt</span>

<span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">Check the types of these values</span>
<span style="color: #f78fe7;">:</span>t x   <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">reports x :: Unit</span>
<span style="color: #f78fe7;">:</span>t y   <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">reports y :: Empty</span>
<span style="color: #f78fe7;">:</span>t z   <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">reports z :: EmptyAlt</span>
</code></pre>
</div>
<p>
Use the scroll bar to see the full example.
</p>

</section>
<section id="slide-org18310c4">
<h3 id="org18310c4"><span class="section-number-3">4.3</span> Implementation of atomic types</h3>
<p>
When we discussed the pure untyped λ-calculus,
we discussed the process of <i>encoding</i> the integers and booleans
as functions, since they were not included in the language.
</p>
<ul>
<li>We also mentioned that we can add constants for them
to the language, forming an <i>unpure</i> untyped λ-calculus.</li>

</ul>

<p>
This raises a question we can ask about
“practical” programming languages as well;
</p>
<ul>
<li>are the “atomic” (“primitive”, “basic”) types <i>truly</i> atomic
(primitive, basic), or are they represented
using one of the language's abstractions?</li>
<li>We have discussed the fact that in Scala and Ruby, which we call
“purely object-oriented”, even these atomic types are classes!
<ul>
<li>Whereas in Java and C++, they are not;
there, they are “primitives” which exist
outside the object-oriented abstraction.</li>

</ul></li>

</ul>

</section>
<section id="slide-orgcb905d6">
<h3 id="orgcb905d6"><span class="section-number-3">4.4</span> Atom or symbol types</h3>
<p>
Many languages include a type of <i>atoms</i> or <i>symbols</i>,
which are essentially interned strings.
</p>
<ul>
<li>Strings which are immutable,
and of which there is only one copy in memory.</li>

</ul>

<p>
Specifically, decendents of Lisp and Prolog tend to have a symbol type.
</p>

<p>
For instance, in Ruby:
</p>
<div class="org-src-container">

<pre  class="src src-ruby"><code trim><span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">A symbol in Ruby begins with a :</span>
x = <span style="color: #00bcff;">:hello</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">We can intern strings using an intern method</span>
y = <span style="color: #79a8ff;">"hello"</span>.intern

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">The equal? method checks if two values are the same object.</span>
<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">These all evaluate to true, since there's only one copy of the symbol hello.</span>
<span style="color: #f78fe7;">puts</span> x.equal?<span style="color: #00cd68;">(</span>y<span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">puts</span> <span style="color: #00bcff;">:hello</span>.equal?<span style="color: #00cd68;">(</span>x<span style="color: #00cd68;">)</span>
<span style="color: #f78fe7;">puts</span> y.equal?<span style="color: #00cd68;">(</span><span style="color: #00bcff;">:hello</span><span style="color: #00cd68;">)</span>

<span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">But this to false, because these are two copies of the same string!</span>
<span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"hello"</span>.equal?<span style="color: #00cd68;">(</span><span style="color: #79a8ff;">"hello"</span><span style="color: #00cd68;">)</span>
</code></pre>
</div>

</section>
<section id="slide-org80ac613">
<h3 id="org80ac613"><span class="section-number-3">4.5</span> Ordinal types</h3>
<p>
Many languages include a means of defining other <i>finite</i> types.
Instances include
</p>
<ul>
<li>enumeration types (<code>enum</code>'s) and</li>
<li>subset/subrange types.</li>

</ul>

<p>
For instance, Pascal supports both enumerations
and subranges.
(This example based on one from the <a href="https://wiki.freepascal.org/Data_type">Free Pascal and Lazarus Wiki</a>.)
</p>
<div class="org-src-container">

<pre  class="src src-pascal"><code trim><span style="color: #f78fe7;">type</span>
  <span style="color: #a8a8a8;">// An enumeration type; unless specified,</span>
  <span style="color: #a8a8a8;">// the first element is implicitely assigned the ordinal value 0,</span>
  <span style="color: #a8a8a8;">// the second ordinal value 1, etc.</span>
  DaysOfWeek = <span style="color: #00cd68;">(</span>Sunday, Monday, Tuesday, Wednesday,
                Thursday, Friday, Saturday<span style="color: #00cd68;">)</span>;

  <span style="color: #a8a8a8;">// A subrange type.</span>
  <span style="color: #a8a8a8;">// In this case, DaysOfWorkWeek contains the ordinals 1,2,3,4 and 5.</span>
  DaysOfWorkWeek = Monday..Friday;
</code></pre>
</div>

</section>
<section id="slide-orgb799b80">
<h3 id="orgb799b80"><span class="section-number-3">4.6</span> Less common numeric types</h3>
<ul>
<li><b>Complex</b> numbers
<ul>
<li>Especially for scientific computation.</li>

</ul></li>
<li><b>Decimal</b> (representation of) numbers
<ul>
<li>Especially for business (monetary) applications.</li>
<li>There are decimal numbers that cannot be properly represented
using binary (e.g. <code>0.3 = 0.010011</code>, repeating)</li>
<li>Not included in all languages because
they cannot be efficiently represented.
<ul>
<li>For instance, to store a decimal digit directly
(without conversion to binary) takes at least 4 bits.</li>
<li>There are 10 possibilities, too many for 3 bits (which can
only have 8 different states.)</li>
<li>But 4 bits could represent 16 states (6 more than needed.)</li>
<li>For memory access reasons, some such implementations
even use 8 bits (one byte) per decimal digit.</li>

</ul></li>

</ul></li>

</ul>

</section>
