notes/5--Types.org
*** Complex numbers in C#

(This example code taken from the
[[https://docs.microsoft.com/en-us/dotnet/api/system.numerics.complex?view=netcore-3.1][.NET documentation]].)
#+begin_src csh
using System;
using System.Numerics;

public class Example
{
   public static void Main()
   {
      // Create a complex number by calling its class constructor.
      Complex c1 = new Complex(12, 6);
      Console.WriteLine(c1);

      // Assign a Double to a complex number.
      Complex c2 = 3.14;
      Console.WriteLine(c2);

      // Cast a Decimal to a complex number.
      Complex c3 = (Complex) 12.3m;
      Console.WriteLine(c3);

      // Assign the return value of a method to a Complex variable.
      Complex c4 = Complex.Pow(Complex.One, -1);
      Console.WriteLine(c4);

      // Assign the value returned by an operator to a Complex variable.
      Complex c5 = Complex.One + Complex.One;
      Console.WriteLine(c5);

      // Instantiate a complex number from its polar coordinates.
      Complex c6 = Complex.FromPolarCoordinates(10, .524);
      Console.WriteLine(c6);
   }
}
// The example displays the following output:
//       (12, 6)
//       (3.14, 0)
//       (12.3, 0)
//       (1, 0)
//       (2, 0)
//       (8.65824721882145, 5.00347430269914)
#+end_src
@@html: Use the scroll bar to see the full example.@@

*** Decimal numbers in C#

(This example code taken from the
[[https://docs.microsoft.com/en-us/dotnet/api/system.decimal?view=netcore-3.1][.NET documentation]].)
#+begin_src csh
// Keeping my fortune in Decimals to avoid the round-off errors.
class PiggyBank {
    protected decimal MyFortune;

    public void AddPenny() {
        MyFortune = Decimal.Add(MyFortune, .01m);
    }

    public decimal Capacity {
        get {
            return Decimal.MaxValue;
        }
    }

    public decimal Dollars {
        get {
            return Decimal.Floor(MyFortune);
        }
    }

    public decimal Cents {
        get {
            return Decimal.Subtract(MyFortune, Decimal.Floor(MyFortune));
        }
    }

    public override string ToString() {
        return MyFortune.ToString("C")+" in piggy bank";
    }
}
#+end_src
@@html: Use the scroll bar to see the full example.@@

* Structured data

** Preamble                                    :ignore:

Of course, we rarely want to deal only with “atomic” data.
More commonly, we are interested in /collections/ of data,
or /alternatives/ between different data types;
these are captured in the notion of /structured/ data.

Specifically, we consider
- products,
- sequences,
  - including arrays and lists
- “sets”
  - (really associative arrays (maps/hashes/tables))
- and unions/variants.
  
** Homogeneous or heterogeneous

An important design decision for any structured type
is whether it is /homogeneous/ or /heterogeneous/.
- “Heterogeneous” structures store elements of differing types.
- “Homogeneous” store only elements of the same type.

** Product types (tuples)

A /heterogeneous/ collection of a /fixed/ number of elements.
- Implemented by, for instance,
  - ~struct~'s or records,
    - both of which have labelled fields,
  - tuples,
    - which are often be implemented as records with
      specially named fields, such as “~first~” or “~_1~”, and
  - classes,
    - which have /methods/ as well as fields.
- In lower level languages, programmers may be concerned
  with the alignment/packing of the data.
  - See [[http://www.catb.org/esr/structure-packing/][this overview]] of structure packing in C,
    and the sort of memory inefficiency that can result
    from poorly ordering the fields of a ~struct~.
    
** Array types

Arrays are an abstraction of finite sequences of
adjacent memory cells.
- Programmers are guaranteed (or required to work around) certain properties.
  - ~O(1)~ access/update time for any element.
    - Implying elements are stored in adjacent memory cells
      (a /contiguous block/ of memory cells.)
    - Also implying each element is of a known, usually constant, size.
      - Heterogeneous arrays can store /references/ to elements of differing types
        instead of elements of those types themselve to maintain this property.
    - To perform a lookup, just look ~element_space * index~ bits
      past the start of the array.
  - ~O(n)~ insert time (if inserting is possible.)
    - The (possibly ~n~-many) elements after the insertion point
      must be shifted.
  - It may be computationally costly or impossible to modify length.

We can classify arrays by where and how their memory is allocated.

** Classification of arrays based on memory allocation: data segment and stack

- Static arrays
  - (Memory) allocation is static, and presumably in the data segment.
  - Subscript ranges are statically bound.
- Fixed stack-dynamic arrays
  - Allocation is dynamic and on the stack,
    done when the declaration of the array is reached.
  - Subscript ranges are statically bound.
- Stack-dynamic arrays
  - Allocation is dynamic and on the stack,
    done when the declaration of the array is reached.
  - Subscript ranges are dynamically bound when the declaration is reached.
  - After declaration, subscript range and storage remain fixed.

** Classification of arrays based on memory allocation: heap

- Fixed heap-dynamic arrays
  - Allocation is dynamic, done when the user program requests.
  - Subscript ranges are dynamically bound at allocation time.
    After allocation, subscript range and storage remain fixed.
- Heap-dynamic arrays
  - Allocation is dynamic, done when the user program requests.
  - Subscript ranges are dynamically bound at allocation time.
  - Subscript range and storage can change throughout runtime!
  - These are commonly implemented as /array-lists/, discussed shortly.
    
** List types

Lists are simply an abstract notion of sequences.
- May be implemented by arrays or by structures such as linked lists.
- Often we do not ~O(1)~ access time for lists.
- But we do have better flexibility;
  - appending or prepending an element into a linked list
    only requires changing a pointer,
  - and inserting into a list only requires changing ~O(n)~ pointers.

Persistance of data is more feasible using linked lists;
parts of the list can be reused.
- For instance, two immutable lists ~[1,2,3,4]~ ~[5,6,3,4]~ can share
  the storage for the ~3~ and ~4~ elements.
    
Lazily (non-strictly) constructed lists may even be “infinite”.
For instance, the infinite list of 1's in Haskell:
#+begin_src haskell
ones = 1 :: ones
#+end_src

