notes/5--Types.html
<section id="slide-orgc3e1a5c">
<h4 id="orgc3e1a5c"><span class="section-number-4">4.6.1</span> Complex numbers in C#</h4>
<p>
(This example code taken from the
<a href="https://docs.microsoft.com/en-us/dotnet/api/system.numerics.complex?view=netcore-3.1">.NET documentation</a>.)
</p>
<div class="org-src-container">

<pre  class="src src-csh"><code trim>using System;
using System.Numerics;

public class Example
{
   public static void Main()
   {
      // Create a complex number by calling its class constructor.
      Complex c1 = new Complex(12, 6);
      Console.WriteLine(c1);

      // Assign a Double to a complex number.
      Complex c2 = 3.14;
      Console.WriteLine(c2);

      // Cast a Decimal to a complex number.
      Complex c3 = (Complex) 12.3m;
      Console.WriteLine(c3);

      // Assign the return value of a method to a Complex variable.
      Complex c4 = Complex.Pow(Complex.One, -1);
      Console.WriteLine(c4);

      // Assign the value returned by an operator to a Complex variable.
      Complex c5 = Complex.One + Complex.One;
      Console.WriteLine(c5);

      // Instantiate a complex number from its polar coordinates.
      Complex c6 = Complex.FromPolarCoordinates(10, .524);
      Console.WriteLine(c6);
   }
}
// The example displays the following output:
//       (12, 6)
//       (3.14, 0)
//       (12.3, 0)
//       (1, 0)
//       (2, 0)
//       (8.65824721882145, 5.00347430269914)
</code></pre>
</div>
<p>
 Use the scroll bar to see the full example.
</p>

</section>
<section id="slide-org41ec6e3">
<h4 id="org41ec6e3"><span class="section-number-4">4.6.2</span> Decimal numbers in C#</h4>
<p>
(This example code taken from the
<a href="https://docs.microsoft.com/en-us/dotnet/api/system.decimal?view=netcore-3.1">.NET documentation</a>.)
</p>
<div class="org-src-container">

<pre  class="src src-csh"><code trim>// Keeping my fortune in Decimals to avoid the round-off errors.
class PiggyBank {
    protected decimal MyFortune;

    public void AddPenny() {
        MyFortune = Decimal.Add(MyFortune, .01m);
    }

    public decimal Capacity {
        get {
            return Decimal.MaxValue;
        }
    }

    public decimal Dollars {
        get {
            return Decimal.Floor(MyFortune);
        }
    }

    public decimal Cents {
        get {
            return Decimal.Subtract(MyFortune, Decimal.Floor(MyFortune));
        }
    }

    public override string ToString() {
        return MyFortune.ToString("C")+" in piggy bank";
    }
}
</code></pre>
</div>
<p>
 Use the scroll bar to see the full example.
</p>

</section>
</section>
<section>
<section id="slide-org70c3254">
<h2 id="org70c3254"><span class="section-number-2">5</span> Structured data</h2>
<p>
Of course, we rarely want to deal only with “atomic” data.
More commonly, we are interested in <i>collections</i> of data,
or <i>alternatives</i> between different data types;
these are captured in the notion of <i>structured</i> data.
</p>

<p>
Specifically, we consider
</p>
<ul>
<li>products,</li>
<li>sequences,
<ul>
<li>including arrays and lists</li>

</ul></li>
<li>“sets”
<ul>
<li>(really associative arrays (maps/hashes/tables))</li>

</ul></li>
<li>and unions/variants.</li>

</ul>

</section>
<section id="slide-orgc35d009">
<h3 id="orgc35d009"><span class="section-number-3">5.1</span> Homogeneous or heterogeneous</h3>
<p>
An important design decision for any structured type
is whether it is <i>homogeneous</i> or <i>heterogeneous</i>.
</p>
<ul>
<li>“Heterogeneous” structures store elements of differing types.</li>
<li>“Homogeneous” store only elements of the same type.</li>

</ul>

</section>
<section id="slide-orgd28727a">
<h3 id="orgd28727a"><span class="section-number-3">5.2</span> Product types (tuples)</h3>
<p>
A <i>heterogeneous</i> collection of a <i>fixed</i> number of elements.
</p>
<ul>
<li>Implemented by, for instance,
<ul>
<li><code>struct</code>'s or records,
<ul>
<li>both of which have labelled fields,</li>

</ul></li>
<li>tuples,
<ul>
<li>which are often be implemented as records with
specially named fields, such as “<code>first</code>” or “<code>_1</code>”, and</li>

</ul></li>
<li>classes,
<ul>
<li>which have <i>methods</i> as well as fields.</li>

</ul></li>

</ul></li>
<li>In lower level languages, programmers may be concerned
with the alignment/packing of the data.
<ul>
<li>See <a href="http://www.catb.org/esr/structure-packing/">this overview</a> of structure packing in C,
and the sort of memory inefficiency that can result
from poorly ordering the fields of a <code>struct</code>.</li>

</ul></li>

</ul>

</section>
<section id="slide-org446edf1">
<h3 id="org446edf1"><span class="section-number-3">5.3</span> Array types</h3>
<p>
Arrays are an abstraction of finite sequences of
adjacent memory cells.
</p>
<ul>
<li>Programmers are guaranteed (or required to work around) certain properties.
<ul>
<li><code>O(1)</code> access/update time for any element.
<ul>
<li>Implying elements are stored in adjacent memory cells
(a <i>contiguous block</i> of memory cells.)</li>
<li>Also implying each element is of a known, usually constant, size.
<ul>
<li>Heterogeneous arrays can store <i>references</i> to elements of differing types
instead of elements of those types themselve to maintain this property.</li>

</ul></li>
<li>To perform a lookup, just look <code>element_space * index</code> bits
past the start of the array.</li>

</ul></li>
<li><code>O(n)</code> insert time (if inserting is possible.)
<ul>
<li>The (possibly <code>n</code>-many) elements after the insertion point
must be shifted.</li>

</ul></li>
<li>It may be computationally costly or impossible to modify length.</li>

</ul></li>

</ul>

<p>
We can classify arrays by where and how their memory is allocated.
</p>

</section>
<section id="slide-org02a4a0d">
<h3 id="org02a4a0d"><span class="section-number-3">5.4</span> Classification of arrays based on memory allocation: data segment and stack</h3>
<ul>
<li>Static arrays
<ul>
<li>(Memory) allocation is static, and presumably in the data segment.</li>
<li>Subscript ranges are statically bound.</li>

</ul></li>
<li>Fixed stack-dynamic arrays
<ul>
<li>Allocation is dynamic and on the stack,
done when the declaration of the array is reached.</li>
<li>Subscript ranges are statically bound.</li>

</ul></li>
<li>Stack-dynamic arrays
<ul>
<li>Allocation is dynamic and on the stack,
done when the declaration of the array is reached.</li>
<li>Subscript ranges are dynamically bound when the declaration is reached.</li>
<li>After declaration, subscript range and storage remain fixed.</li>

</ul></li>

</ul>

</section>
<section id="slide-orgf552918">
<h3 id="orgf552918"><span class="section-number-3">5.5</span> Classification of arrays based on memory allocation: heap</h3>
<ul>
<li>Fixed heap-dynamic arrays
<ul>
<li>Allocation is dynamic, done when the user program requests.</li>
<li>Subscript ranges are dynamically bound at allocation time.
After allocation, subscript range and storage remain fixed.</li>

</ul></li>
<li>Heap-dynamic arrays
<ul>
<li>Allocation is dynamic, done when the user program requests.</li>
<li>Subscript ranges are dynamically bound at allocation time.</li>
<li>Subscript range and storage can change throughout runtime!</li>
<li>These are commonly implemented as <i>array-lists</i>, discussed shortly.</li>

</ul></li>

</ul>

</section>
<section id="slide-orgbccd9dc">
<h3 id="orgbccd9dc"><span class="section-number-3">5.6</span> List types</h3>
<p>
Lists are simply an abstract notion of sequences.
</p>
<ul>
<li>May be implemented by arrays or by structures such as linked lists.</li>
<li>Often we do not <code>O(1)</code> access time for lists.</li>
<li>But we do have better flexibility;
<ul>
<li>appending or prepending an element into a linked list
only requires changing a pointer,</li>
<li>and inserting into a list only requires changing <code>O(n)</code> pointers.</li>

</ul></li>

</ul>

<p>
Persistance of data is more feasible using linked lists;
parts of the list can be reused.
</p>
<ul>
<li>For instance, two immutable lists <code>[1,2,3,4]</code> <code>[5,6,3,4]</code> can share
the storage for the <code>3</code> and <code>4</code> elements.</li>

</ul>

<p>
Lazily (non-strictly) constructed lists may even be “infinite”.
For instance, the infinite list of 1's in Haskell:
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #feacd0;">ones</span> <span style="color: #00d3d0;">=</span> 1 <span style="color: #00d3d0;">::</span> ones
</code></pre>
</div>

</section>
