notes/5--Types.org
** Array lists

An /array list/ type provides the flexibility of a list,
but the performance of an array (except for the occasional reallocation.)
- Array lists are stored in a continguous block of memory cells.
- And the block is just reallocated when the array grows too large.
  - Reallocating memory is costly,
    and it requires copying the elements to the new memory,
    and so there is a performance dip when this is needed.
  - Generally, /twice as much/ memory as is needed is allocated.
    - So as the size of the list grows, so does the extra memory allocated
      at each reallocation.
    - This mitigates the cost of reallocation; it becomes less frequent
      as time goes on.

** “Sets”

It is notoriously difficult to represent unordered collections
such as sets and bags on computers.
- Computers are extremely ordered machines; how do we store
  unordered collections in ordered memory?
- When available, “set types” are usually implemented
  using /trees/ or /associative arrays/ (discussed next.)

** Associative array (map, hash, table) types

Associative arrays, also called /hashes/, /maps/ or sometimes /tables/,
are sets of key/value pairs.
- Abstracts away the ordering of the sequence.
  - (Though we could order the keys, and so impose
     an order on the collection.)
- The programmer can imagine they are lists of key/value pairs.
  - And they may even be implemented that way.
    - But in practical languages, they are more often
      implemented by sorting elements into “buckets”
      by a hashing function on the keys.
    - The implementations get quite complex.
    
** Unions, variants

Whereas an element of a product type contains
- a collection of elements of some types,
a /union/ or variant type contains
- one element of a selection of types.

Unions can be /tagged/ or /untagged/.
- With an untagged union, the runtime does not
  keep track of the underlying type of the element.
- Whereas a tagged union uses a /tag/ on the value to identify
  the underlying type of the element.

Note that union types are unnecessary
in dynamically type checked language.
- We can think of every variable/argument/procedure's type
  as being a union of all possible types.

** Untagged unions

As we've said, with an untagged union,
the runtime does not keep track of the underlying type of elements.
- So it's type is dynamic! (Amongst the types involved in the union.)
- Languages that provide untagged unions (today, mainly C and C++)
  do not even dynamically check the type.
- Accessing it as the wrong type simply treats the bits
  as if they were of that type; it is not a cast!
- This is /very/ unsafe; it allows for type clashes.

*** An example usage of untagged unions in C++

We can see the danger of untagged unions in a short C++ example;
we are legally allowed to interpret the bits of an integer
as if they were the bits of a floating point,
which has a very different arrangement in memory!
#+begin_src C++ :results output
#include<iostream>

union foo {
  int a;
  float b;
};

int main() {
  foo x;

  x.a = 1; // Set x as an integer.
  
  std::cout << x.b; // Treat x as a float, even though it's an int right now.
                    // The typechecker does not complain!
  
  // Outputs 1.4013e-45 during my testing;
  // the result of interpreting the bits of x as a float.
}
#+end_src

For a more practical usage of untagged unions, see the example
implementation of a language of integer expressions in C++,
provided in homework 6.

** Tagged unions and pattern matching

Tagged unions are also known as
- /sum/ and /either/ types, or
- as /variant/ types when the labels are chosen by the programmer.

The introduction of tags or labels makes /pattern matching/ a viable
and useful control structure.

Given a variant type such as
#+begin_src haskell
data Foo = A Int | B Float
#+end_src

We can /match/ on the tag, using placeholder variables
for the values of the underlying types.
#+begin_src haskell
bar :: Foo -> Int
bar (A i) = i   -- i is a placeholder for the integer value.
bar (B _) = 0   -- An example of a nameless placeholder, _.
#+end_src
Many languages also allow the use of constants
instead of placeholder variables, to create more specific cases.

** Recursive unions

If a union type is allowed to be /recursive/ (meaning that
one of the underlying types of the union is allowed to be
the type being defined as the union),
then union and product types together allow for the definition
of /algebraic datatypes/ (discussed later.)

A well-known example is to define lists as a recursive union
of products.
#+begin_src haskell
data List = Cons (Int, List) | Empty
#+end_src

(Using a type parameter and currying, we get this more flexible
definition more in the style of most functional languages.)
#+begin_src haskell
data List A = Cons A (List A) | Empty
#+end_src

* COMMENT The algebra of types

** Preamble                                    :ignore:

At the end of the preceding section of these notes, we mentioned
#+begin_quote
“If a union type is allowed to be /recursive/,
 then union and product types together allow for the definition
 of /algebraic datatypes/.”
#+end_quote

Here, we briefly discuss why the types resulting from
possibly recursive unions of products are called /algebraic/.

