notes/5--Types.html
<section id="slide-org6ad1e23">
<h3 id="org6ad1e23"><span class="section-number-3">5.7</span> Array lists</h3>
<p>
An <i>array list</i> type provides the flexibility of a list,
but the performance of an array (except for the occasional reallocation.)
</p>
<ul>
<li>Array lists are stored in a continguous block of memory cells.</li>
<li>And the block is just reallocated when the array grows too large.
<ul>
<li>Reallocating memory is costly,
and it requires copying the elements to the new memory,
and so there is a performance dip when this is needed.</li>
<li>Generally, <i>twice as much</i> memory as is needed is allocated.
<ul>
<li>So as the size of the list grows, so does the extra memory allocated
at each reallocation.</li>
<li>This mitigates the cost of reallocation; it becomes less frequent
as time goes on.</li>

</ul></li>

</ul></li>

</ul>

</section>
<section id="slide-org4403c55">
<h3 id="org4403c55"><span class="section-number-3">5.8</span> “Sets”</h3>
<p>
It is notoriously difficult to represent unordered collections
such as sets and bags on computers.
</p>
<ul>
<li>Computers are extremely ordered machines; how do we store
unordered collections in ordered memory?</li>
<li>When available, “set types” are usually implemented
using <i>trees</i> or <i>associative arrays</i> (discussed next.)</li>

</ul>

</section>
<section id="slide-org7dbc053">
<h3 id="org7dbc053"><span class="section-number-3">5.9</span> Associative array (map, hash, table) types</h3>
<p>
Associative arrays, also called <i>hashes</i>, <i>maps</i> or sometimes <i>tables</i>,
are sets of key/value pairs.
</p>
<ul>
<li>Abstracts away the ordering of the sequence.
<ul>
<li>(Though we could order the keys, and so impose
an order on the collection.)</li>

</ul></li>
<li>The programmer can imagine they are lists of key/value pairs.
<ul>
<li>And they may even be implemented that way.
<ul>
<li>But in practical languages, they are more often
implemented by sorting elements into “buckets”
by a hashing function on the keys.</li>
<li>The implementations get quite complex.</li>

</ul></li>

</ul></li>

</ul>

</section>
<section id="slide-orgf04eee9">
<h3 id="orgf04eee9"><span class="section-number-3">5.10</span> Unions, variants</h3>
<p>
Whereas an element of a product type contains
</p>
<ul>
<li>a collection of elements of some types,</li>

</ul>
<p>
a <i>union</i> or variant type contains
</p>
<ul>
<li>one element of a selection of types.</li>

</ul>

<p>
Unions can be <i>tagged</i> or <i>untagged</i>.
</p>
<ul>
<li>With an untagged union, the runtime does not
keep track of the underlying type of the element.</li>
<li>Whereas a tagged union uses a <i>tag</i> on the value to identify
the underlying type of the element.</li>

</ul>

<p>
Note that union types are unnecessary
in dynamically type checked language.
</p>
<ul>
<li>We can think of every variable/argument/procedure's type
as being a union of all possible types.</li>

</ul>

</section>
<section id="slide-org55cf72c">
<h3 id="org55cf72c"><span class="section-number-3">5.11</span> Untagged unions</h3>
<p>
As we've said, with an untagged union,
the runtime does not keep track of the underlying type of elements.
</p>
<ul>
<li>So it's type is dynamic! (Amongst the types involved in the union.)</li>
<li>Languages that provide untagged unions (today, mainly C and C++)
do not even dynamically check the type.</li>
<li>Accessing it as the wrong type simply treats the bits
as if they were of that type; it is not a cast!</li>
<li>This is <i>very</i> unsafe; it allows for type clashes.</li>

</ul>

</section>
<section id="slide-org817cc61">
<h4 id="org817cc61"><span class="section-number-4">5.11.1</span> An example usage of untagged unions in C++</h4>
<p>
We can see the danger of untagged unions in a short C++ example;
we are legally allowed to interpret the bits of an integer
as if they were the bits of a floating point,
which has a very different arrangement in memory!
</p>
<div class="org-src-container">

<pre  class="src src-C++"><code trim><span style="color: #ff9977;">#include</span><span style="color: #00cd68;">&lt;</span><span style="color: #79a8ff;">iostream</span><span style="color: #00cd68;">&gt;</span>

<span style="color: #b6a0ff;">union</span> <span style="color: #f78fe7;">foo</span> <span style="color: #00cd68;">{</span>
  <span style="color: #f78fe7;">int</span> <span style="color: #00d3d0;">a</span>;
  <span style="color: #f78fe7;">float</span> <span style="color: #00d3d0;">b</span>;
<span style="color: #00cd68;">}</span>;

<span style="color: #f78fe7;">int</span> <span style="color: #feacd0;">main</span><span style="color: #00cd68;">()</span> <span style="color: #00cd68;">{</span>
  <span style="color: #f78fe7;">foo</span> <span style="color: #00d3d0;">x</span>;

  x.a = 1; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Set x as an integer.</span>
  
  <span style="color: #00bcff;">std</span>::cout &lt;&lt; x.b; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Treat x as a float, even though it's an int right now.</span>
                    <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">The typechecker does not complain!</span>
  
  <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">Outputs 1.4013e-45 during my testing;</span>
  <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">the result of interpreting the bits of x as a float.</span>
<span style="color: #00cd68;">}</span>
</code></pre>
</div>

<p>
For a more practical usage of untagged unions, see the example
implementation of a language of integer expressions in C++,
provided in homework 6.
</p>

</section>
<section id="slide-orgcc94980">
<h3 id="orgcc94980"><span class="section-number-3">5.12</span> Tagged unions and pattern matching</h3>
<p>
Tagged unions are also known as
</p>
<ul>
<li><i>sum</i> and <i>either</i> types, or</li>
<li>as <i>variant</i> types when the labels are chosen by the programmer.</li>

</ul>

<p>
The introduction of tags or labels makes <i>pattern matching</i> a viable
and useful control structure.
</p>

<p>
Given a variant type such as
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b6a0ff;">data</span> <span style="color: #f78fe7;">Foo</span> <span style="color: #00d3d0;">=</span> <span style="color: #f78fe7;">A</span> <span style="color: #f78fe7;">Int</span> <span style="color: #00d3d0;">|</span> <span style="color: #f78fe7;">B</span> <span style="color: #f78fe7;">Float</span>
</code></pre>
</div>

<p>
We can <i>match</i> on the tag, using placeholder variables
for the values of the underlying types.
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #feacd0;">bar</span> <span style="color: #00d3d0;">::</span> <span style="color: #f78fe7;">Foo</span> <span style="color: #00d3d0;">-&gt;</span> <span style="color: #f78fe7;">Int</span>
<span style="color: #feacd0;">bar</span> <span style="color: #00cd68;">(</span><span style="color: #f78fe7;">A</span> i<span style="color: #00cd68;">)</span> <span style="color: #00d3d0;">=</span> i   <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">i is a placeholder for the integer value.</span>
<span style="color: #feacd0;">bar</span> <span style="color: #00cd68;">(</span><span style="color: #f78fe7;">B</span> <span style="color: #b6a0ff;">_</span><span style="color: #00cd68;">)</span> <span style="color: #00d3d0;">=</span> 0   <span style="color: #a8a8a8;">-- </span><span style="color: #a8a8a8;">An example of a nameless placeholder, _.</span>
</code></pre>
</div>
<p>
Many languages also allow the use of constants
instead of placeholder variables, to create more specific cases.
</p>

</section>
<section id="slide-orgb1e667e">
<h3 id="orgb1e667e"><span class="section-number-3">5.13</span> Recursive unions</h3>
<p>
If a union type is allowed to be <i>recursive</i> (meaning that
one of the underlying types of the union is allowed to be
the type being defined as the union),
then union and product types together allow for the definition
of <i>algebraic datatypes</i> (discussed later.)
</p>

<p>
A well-known example is to define lists as a recursive union
of products.
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b6a0ff;">data</span> <span style="color: #f78fe7;">List</span> <span style="color: #00d3d0;">=</span> <span style="color: #f78fe7;">Cons</span> <span style="color: #00cd68;">(</span><span style="color: #f78fe7;">Int</span>, <span style="color: #f78fe7;">List</span><span style="color: #00cd68;">)</span> <span style="color: #00d3d0;">|</span> <span style="color: #f78fe7;">Empty</span>
</code></pre>
</div>

<p>
(Using a type parameter and currying, we get this more flexible
definition more in the style of most functional languages.)
</p>
<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #b6a0ff;">data</span> <span style="color: #f78fe7;">List</span> <span style="color: #f78fe7;">A</span> <span style="color: #00d3d0;">=</span> <span style="color: #f78fe7;">Cons</span> <span style="color: #f78fe7;">A</span> <span style="color: #00cd68;">(</span><span style="color: #f78fe7;">List</span> <span style="color: #f78fe7;">A</span><span style="color: #00cd68;">)</span> <span style="color: #00d3d0;">|</span> <span style="color: #f78fe7;">Empty</span>
</code></pre>
</div>

</section>
</section>
